InformationRegisters/ИсторияДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Действия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИсторияДоступа/Ext/Module.bsl
Процедура ЗалогироватьСобытие(Секрет, Действие) Экспорт
	Запись = РегистрыСведений.ИсторияДоступа.СоздатьМенеджерЗаписи();
	Запись.Секрет = Секрет;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.ДатаВремя = ТекущаяДатаСеанса();
	Запись.Действие = Действие;
	Запись.Записать();
КонецПроцедуры
